app/Models/RegistrationModel.php

    private function getUserByPhoneOrEmail($identifier)
    {
        // Query the database to find the user by phone number or email address
        // Here's an example assuming you're using CodeIgniter's Query Builder
        $query = $this->db->table('users')
                        ->where('phone', $identifier)
                        ->orWhere('email', $identifier)
                        ->get();
---
SELECT *
FROM `users`
WHERE `phone` = 'arjun@gmail.com'
OR `email` = 'arjun@gmail.com'