app/Models/RegistrationModel.php

SELECT *
FROM `users`
WHERE `email` = 'officer2@gmail.com'
---
    private function get_customer_by_email($email) {
        // Implement a method to retrieve a customer by email from the database
        // This method may vary depending on your database structure and ORM usage
        // Here's a simplified example assuming you're using CodeIgniter's Query Builder
        $query = $this->db->table('users')->where('email', $email)->get();

SELECT *
FROM `users`
WHERE `phone` = '1@gmail.com'
OR `email` = '1@gmail.com'
---
    private function getUserByPhoneOrEmail($identifier)
    {

        // Query the database to find the user by phone number or email address
        // Here's an example assuming you're using CodeIgniter's Query Builder
        return $this->db->table('users')
                        ->where('phone', $identifier)
                        ->orWhere('email', $identifier)
                        ->get()
                        ->getRow();